Catalogs/Renault_ПрофилиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПрофилиКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БлокироватьЗвонки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьИнформационныеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьМаркетинговыеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьСрочныеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПрофилей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонитьПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонитьС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовпадениеПоКонтактнойИнформации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРодственников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьСмсМаркетинговые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьСмсИнформационные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьСмсСрочные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьЗвонкиМаркетинговые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьЗвонкиИнформационные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьЗвонкиСрочные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoldenId</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоФИО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоТелефону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоАдресуЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоАвтомобилю</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактыКлиента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКонтакта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РодственныеСвязи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрофильРодственника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПрофилиКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_СтепениРодстваФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тест</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Renault_НормализованныеКонтактыДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НормализованныеКонтактыДляПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_ЖурналВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_ЖурналВзаимодействий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПланируемая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКонтакта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыКонтактаКампаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Кампании</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыСобытий</v8:Type>
						<v8:Type>cfg:CatalogRef.DMS_ДействияПоОбращениям</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидыОбращенийВАвтосервис</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Лид</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_КоммерческоеПредложение</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_КонтактСКлиентом</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
						<v8:Type>cfg:DocumentRef.DMS_ОбращениеКлиента</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>SMS_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Подсистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_ДанныеФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_ДанныеФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Renault_ПрофилиКлиентов/Ext/ManagerModule.bsl
Функция СохранитьКлиентаВПрофиль(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Renault_ПрофилиКлиентовКлиенты.Ссылка
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентовКлиенты
		|ГДЕ
		|	Renault_ПрофилиКлиентовКлиенты.Клиент = &Клиент
		|	И Renault_ПрофилиКлиентовКлиенты.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	//Если заполнен контрагент у потенциального клиента, то ищем профиль контрагента.
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") 
		и ЗначениеЗаполнено(Клиент.Контрагент) тогда
		ИскомыйКлиент = Клиент.Контрагент;
	Иначе 
		ИскомыйКлиент = Клиент;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Клиент", ИскомыйКлиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		
		//Для помеченного на удаление - не создаем новый профиль.	
		Если Клиент.ПометкаУдаления тогда 
			Возврат Справочники.Renault_ПрофилиКлиентов.ПустаяСсылка();
		КонецЕсли;
		
		Профиль = Справочники.Renault_ПрофилиКлиентов.СоздатьЭлемент();
		Строка = Профиль.Клиенты.Добавить();
		Строка.Клиент = Клиент;
		Строка.ТипКлиента = ?(ТипЗнч(Строка.Клиент) = Тип("СправочникСсылка.Контрагенты"), "Контрагент", "Потенциальный");
		Профиль.Записать();
		Возврат Профиль.Ссылка;
	Иначе
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьКлиента(Профиль, Клиент) Экспорт
	
	Объект = Профиль.ПолучитьОбъект();
	
	Найдено = Объект.Клиенты.Найти(Клиент, "Клиент");
	Если Найдено <> Неопределено Тогда
		Объект.Клиенты.Удалить(Найдено);
	КонецЕсли;
	
	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_ПрофилиКлиентовКлиенты.Ссылка
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентовКлиенты
		|ГДЕ
		|	Renault_ПрофилиКлиентовКлиенты.Клиент = &Клиент
		|	И Renault_ПрофилиКлиентовКлиенты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Renault_ПрофилиКлиентовКлиенты.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Ссылка", Профиль);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Строка = Объект.Клиенты.Добавить();
		Строка.Клиент = Клиент;
		Строка.ТипКлиента = ?(ТипЗнч(Строка.Клиент) = Тип("СправочникСсылка.Контрагенты"), "Контрагент", "Потенциальный");
	Иначе
		Выборка.Следующий();
		Клиенты = Выборка.Ссылка.Клиенты;
		Для Каждого Клиент_ Из Клиенты Цикл
			Строка = Объект.Клиенты.Добавить();
			Строка.Клиент = Клиент;
			Строка.ТипКлиента = ?(ТипЗнч(Строка.Клиент) = Тип("СправочникСсылка.Контрагенты"), "Контрагент", "Потенциальный");
		КонецЦикла;
		
		ПрофильОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПрофильОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	Объект.Записать();
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция Используются() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция НайтиПрофильКлиента(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Renault_ПрофилиКлиентовКлиенты.Ссылка
	               |ИЗ
	               |	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентовКлиенты
	               |ГДЕ
	               |	Renault_ПрофилиКлиентовКлиенты.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКлиентов(Клиент) Экспорт
	
	Клиенты = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_ПрофилиКлиентов.Ссылка
		|ПОМЕСТИТЬ ВтПрофиль
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентов
		|ГДЕ
		|	Renault_ПрофилиКлиентов.Клиент = &Клиент
		|	И Renault_ПрофилиКлиентов.Ссылка.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_ПрофилиКлиентов.Клиент
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПрофиль КАК ВтПрофиль
		|		ПО (ВтПрофиль.Ссылка = Renault_ПрофилиКлиентов.Ссылка)";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Клиенты.Добавить(Клиент);
	Иначе
		Пока Выборка.Следующий() Цикл
			Клиенты.Добавить(Выборка.Клиент);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Клиенты;
	
КонецФункции

Функция ПолучитьСписокКлиентов(Клиент) Экспорт
	
	СписокКлиентов = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_НормализованныеКонтактыДляПоиска.Данные,
	|	Renault_НормализованныеКонтактыДляПоиска1.Объект КАК Клиент
	|ИЗ
	|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска1
	|		ПО Renault_НормализованныеКонтактыДляПоиска.Данные = Renault_НормализованныеКонтактыДляПоиска1.Данные
	|ГДЕ
	|	Renault_НормализованныеКонтактыДляПоиска.Объект = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() цикл
		СписокКлиентов.Добавить(Выборка.Клиент);
	КонецЦикла;
	
	Возврат СписокКлиентов;
	
КонецФункции

Функция ПолучитьТаблицуВзаимодействия(СписокКлиентов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	DMS_ЖурналВзаимодействий.ДатаСобытия КАК ДатаСобытия,
	               |	DMS_ЖурналВзаимодействий.ИД КАК Количество
	               |ИЗ
	               |	РегистрСведений.DMS_ЖурналВзаимодействий КАК DMS_ЖурналВзаимодействий
	               |ГДЕ
	               |	DMS_ЖурналВзаимодействий.Клиент В(&СписокКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_CommunicationCenter_Обзвон.Дата,
	               |	1
	               |ИЗ
	               |	Документ.Renault_CommunicationCenter_Обзвон КАК Renault_CommunicationCenter_Обзвон
	               |ГДЕ
	               |	Renault_CommunicationCenter_Обзвон.Клиент В(&СписокКлиентов)
	               |	И НЕ Renault_CommunicationCenter_Обзвон.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСобытия";
	Запрос.УстановитьПараметр("СписокКлиентов", СписокКлиентов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Параметры: СтруктураКонтакта - Структура с полями "Клиент", "ТипКонтакта", "Контакт"
Процедура ЗаписатьКонтактКлиента(СтруктураКонтакта) Экспорт
	
	Если НЕ (СтруктураКонтакта.Свойство("Клиент")
		И СтруктураКонтакта.Свойство("ТипКонтакта")
		И СтруктураКонтакта.Свойство("Контакт")) Тогда
		//Неверная структура контактной информации
		Возврат;
	КонецЕсли;
	
	Профиль = НайтиПрофильКлиента(СтруктураКонтакта.Клиент);
	Если Профиль <> Неопределено Тогда
		ПрофильОбъект = Профиль.ПолучитьОбъект();
		Строки = ПрофильОбъект.КонтактыКлиента.НайтиСтроки(СтруктураКонтакта);
		Если НЕ ЗначениеЗаполнено(Строки) Тогда
			НоваяСтрока = ПрофильОбъект.КонтактыКлиента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураКонтакта);
			ПрофильОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура СоздатьИзменитьПрофильКонтрагента(КонтрагентСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	
	СтруктураФИО = DMS_ФизическиеЛицаСервер.ФамилияИмяОтчество(КонтрагентСсылка.Наименование);
	
	УдалитьИзСоставаПрофиляФизическогоЛица(КонтрагентСсылка,СтруктураФИО);
	
	Запрос.УстановитьПараметр("Имя", 			СтруктураФИО.Имя);
	Запрос.УстановитьПараметр("Отчество", 		СтруктураФИО.Отчество);
	Запрос.УстановитьПараметр("Фамилия", 		СтруктураФИО.Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицо", КонтрагентСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеФизическихЛиц.ФизическоеЛицо) КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ЗадвоениеПоФИО
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия = &Фамилия
		|	И ДанныеФизическихЛиц.Имя = &Имя
		|	И ДанныеФизическихЛиц.Отчество = &Отчество
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеФизическихЛиц.ФизическоеЛицо) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформацияДругих.Объект,
		|	КонтактнаяИнформацияДругих.Телефон
		|ПОМЕСТИТЬ ЗадвоениеПоТелефону
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК КонтактныеИнформации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК КонтактнаяИнформацияДругих
		|		ПО (КонтактнаяИнформацияДругих.Телефон ПОДОБНО ""%"" + КонтактныеИнформации.Телефон + ""%"")
		|			И (КонтактныеИнформации.Телефон <> """")
		|			И (КонтактнаяИнформацияДругих.Телефон <> """")
		|			И ((ВЫРАЗИТЬ(КонтактныеИнформации.Объект КАК Справочник.Контрагенты)) <> КонтактнаяИнформацияДругих.Объект)
		|			И ((ВЫРАЗИТЬ(КонтактныеИнформации.Объект КАК Справочник.Контрагенты)) = &ФизическоеЛицо)
		|			И (КонтактнаяИнформацияДругих.Объект ССЫЛКА Справочник.Контрагенты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИСТИНА КАК ПоФИО,
		|	ЛОЖЬ КАК ПоТелефону
		|ПОМЕСТИТЬ Задвоение
		|ИЗ
		|	ЗадвоениеПоФИО КАК ЗадвоениеПоФИО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО ЗадвоениеПоФИО.Фамилия = ДанныеФизическихЛиц.Фамилия
		|			И ЗадвоениеПоФИО.Имя = ДанныеФизическихЛиц.Имя
		|			И ЗадвоениеПоФИО.Отчество = ДанныеФизическихЛиц.Отчество
		|			И ((ВЫРАЗИТЬ(ДанныеФизическихЛиц.ФизическоеЛицо КАК Справочник.Контрагенты)) <> &ФизическоеЛицо)
		|			И (ДанныеФизическихЛиц.ФизическоеЛицо ССЫЛКА Справочник.Контрагенты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадвоениеПоТелефону.Объект,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ЗадвоениеПоТелефону КАК ЗадвоениеПоТелефону
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(&ФизическоеЛицо КАК Справочник.Контрагенты),
		|	ИСТИНА,
		|	ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задвоение.ФизическоеЛицо,
		|	МАКСИМУМ(Задвоение.ПоФИО) КАК ПоФИО,
		|	МАКСИМУМ(Задвоение.ПоТелефону) КАК ПоТелефону
		|ПОМЕСТИТЬ мДанные
		|ИЗ
		|	Задвоение КАК Задвоение
		|
		|СГРУППИРОВАТЬ ПО
		|	Задвоение.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(ЕСТЬNULL(мКлиенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Renault_ПрофилиКлиентов.ПустаяСсылка))) КАК Профиль,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(мКлиенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Renault_ПрофилиКлиентов.ПустаяСсылка))) КАК КоличествоПрофилей,
		|	мДанные.ФизическоеЛицо КАК Клиент,
		|	МАКСИМУМ(мДанные.ПоФИО) КАК ПоФИО,
		|	МАКСИМУМ(мДанные.ПоТелефону) КАК ПоТелефону
		|ИЗ
		|	мДанные КАК мДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПрофилиКлиентов.Клиенты КАК мКлиенты
		|		ПО мДанные.ФизическоеЛицо = мКлиенты.Клиент
		|ГДЕ
		|	мДанные.ПоФИО
		|	И мДанные.ПоТелефону
		|
		|СГРУППИРОВАТЬ ПО
		|	мДанные.ФизическоеЛицо
		|ИТОГИ
		|	МАКСИМУМ(Профиль),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоПрофилей)
		|ПО
		|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПрофиля = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаПрофиля.Следующий() Тогда 
		
		Если ЗначениеЗаполнено(ВыборкаПрофиля.Профиль) Тогда
			ОбъектПрофиль = ВыборкаПрофиля.Профиль.ПолучитьОбъект();
		Иначе 
			ОбъектПрофиль = Справочники.Renault_ПрофилиКлиентов.СоздатьЭлемент();
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(ОбъектПрофиль,СтруктураФИО);
		ОбъектПрофиль.Наименование = КонтрагентСсылка.Наименование;
		
		ОчиститьПрошлыеПрофили = (ВыборкаПрофиля.КоличествоПрофилей > 0);
		
		ОбъектПрофиль.Клиенты.Очистить();
		
		ВыборкаКлиентов = ВыборкаПрофиля.Выбрать();
		
		Если ВыборкаКлиентов.Количество() <= 1 Тогда
			Возврат;
		КонецЕсли; 
		
		Если ОбъектПрофиль.ЭтоНовый() Тогда
			ОбъектПрофиль.УстановитьНовыйКод();
		КонецЕсли; 
		
		Пока ВыборкаКлиентов.Следующий() Цикл
			
			НоваяСтрока = ОбъектПрофиль.Клиенты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаКлиентов);
			
			Если ОчиститьПрошлыеПрофили И ЗначениеЗаполнено(ВыборкаКлиентов.Профиль) 
				И ВыборкаКлиентов.Профиль <> ОбъектПрофиль.Ссылка Тогда
				
				мОбъектПрофиль = ВыборкаКлиентов.Профиль.ПолучитьОбъект();
				СтрокаУдаления = мОбъектПрофиль.Клиенты.Найти(ВыборкаКлиентов.Клиент,"Клиент");
				
				Если СтрокаУдаления <> Неопределено Тогда
					
					мОбъектПрофиль.Клиенты.Удалить(СтрокаУдаления);
					мОбъектПрофиль.КоличествоКлиентов = мОбъектПрофиль.Клиенты.Количество();
					
					Если Не мОбъектПрофиль.ПометкаУдаления Тогда
						мОбъектПрофиль.ПометкаУдаления = (мОбъектПрофиль.Клиенты.Количество() = 0);
					КонецЕсли; 
					
					мОбъектПрофиль.ОбменДанными.Загрузка = Истина;
					мОбъектПрофиль.Записать();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбъектПрофиль.КоличествоКлиентов = ОбъектПрофиль.Клиенты.Количество();
		
		ОбъектПрофиль.ОбменДанными.Загрузка = Истина;
		
		ОбъектПрофиль.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьИзменитьПрофильПотенциальногоКонтрагента(ПотенциальныйКонтрагентСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	
	СтруктураФИО = DMS_ФизическиеЛицаСервер.ФамилияИмяОтчество(ПотенциальныйКонтрагентСсылка.Наименование);
	
	УдалитьИзСоставаПрофиляФизическогоЛица(ПотенциальныйКонтрагентСсылка,СтруктураФИО);
	
	Запрос.УстановитьПараметр("Имя", 			СтруктураФИО.Имя);
	Запрос.УстановитьПараметр("Отчество", 		СтруктураФИО.Отчество);
	Запрос.УстановитьПараметр("Фамилия", 		СтруктураФИО.Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ПотенциальныйКонтрагентСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеФизическихЛиц.ФизическоеЛицо) КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ЗадвоениеПоФИО
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия = &Фамилия
		|	И ДанныеФизическихЛиц.Имя = &Имя
		|	И ДанныеФизическихЛиц.Отчество = &Отчество
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеФизическихЛиц.ФизическоеЛицо) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформацияДругих.Объект,
		|	КонтактнаяИнформацияДругих.Телефон
		|ПОМЕСТИТЬ ЗадвоениеПоТелефону
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК КонтактныеИнформации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК КонтактнаяИнформацияДругих
		|		ПО (КонтактнаяИнформацияДругих.Телефон ПОДОБНО ""%"" + КонтактныеИнформации.Телефон + ""%"")
		|			И (КонтактныеИнформации.Телефон <> """")
		|			И ((ВЫРАЗИТЬ(КонтактныеИнформации.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты)) = &ФизическоеЛицо)
		|			И (КонтактнаяИнформацияДругих.Телефон <> """")
		|			И ((ВЫРАЗИТЬ(КонтактныеИнформации.Объект КАК Справочник.CRM_ПотенциальныеКонтрагенты)) <> КонтактнаяИнформацияДругих.Объект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИСТИНА КАК ПоФИО,
		|	ЛОЖЬ КАК ПоТелефону
		|ПОМЕСТИТЬ Задвоение
		|ИЗ
		|	ЗадвоениеПоФИО КАК ЗадвоениеПоФИО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО ЗадвоениеПоФИО.Фамилия = ДанныеФизическихЛиц.Фамилия
		|			И ЗадвоениеПоФИО.Имя = ДанныеФизическихЛиц.Имя
		|			И ЗадвоениеПоФИО.Отчество = ДанныеФизическихЛиц.Отчество
		|			И (ДанныеФизическихЛиц.ФизическоеЛицо <> &ФизическоеЛицо)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадвоениеПоТелефону.Объект,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ЗадвоениеПоТелефону КАК ЗадвоениеПоТелефону
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(&ФизическоеЛицо КАК Справочник.CRM_ПотенциальныеКонтрагенты),
		|	ИСТИНА,
		|	ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задвоение.ФизическоеЛицо,
		|	МАКСИМУМ(Задвоение.ПоФИО) КАК ПоФИО,
		|	МАКСИМУМ(Задвоение.ПоТелефону) КАК ПоТелефону,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Задвоение.ФизическоеЛицо ССЫЛКА Справочник.Контрагенты
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЕстьКонтрагент
		|ПОМЕСТИТЬ мДанные
		|ИЗ
		|	Задвоение КАК Задвоение
		|
		|СГРУППИРОВАТЬ ПО
		|	Задвоение.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(ЕСТЬNULL(мКлиенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Renault_ПрофилиКлиентов.ПустаяСсылка))) КАК Профиль,
		|	мДанные.ФизическоеЛицо КАК Клиент,
		|	МАКСИМУМ(мДанные.ПоФИО) КАК ПоФИО,
		|	МАКСИМУМ(мДанные.ПоТелефону) КАК ПоТелефону,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(мКлиенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Renault_ПрофилиКлиентов.ПустаяСсылка))) КАК КоличествоПрофилей,
		|	МАКСИМУМ(мДанные.ЕстьКонтрагент) КАК ЕстьКонтрагент
		|ИЗ
		|	мДанные КАК мДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПрофилиКлиентов.Клиенты КАК мКлиенты
		|		ПО мДанные.ФизическоеЛицо = мКлиенты.Клиент
		|ГДЕ
		|	мДанные.ПоФИО
		|	И мДанные.ПоТелефону
		|
		|СГРУППИРОВАТЬ ПО
		|	мДанные.ФизическоеЛицо
		|ИТОГИ
		|	МАКСИМУМ(Профиль),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоПрофилей),
		|	МАКСИМУМ(ЕстьКонтрагент)
		|ПО
		|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПрофиля = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаПрофиля.Следующий() Тогда 
		
		Если ЗначениеЗаполнено(ВыборкаПрофиля.Профиль) Тогда
			ОбъектПрофиль = ВыборкаПрофиля.Профиль.ПолучитьОбъект();
		Иначе 
			ОбъектПрофиль = Справочники.Renault_ПрофилиКлиентов.СоздатьЭлемент();
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(ОбъектПрофиль,СтруктураФИО);
		ОбъектПрофиль.Наименование = ПотенциальныйКонтрагентСсылка.Наименование;
		
		ОчиститьПрошлыеПрофили = (ВыборкаПрофиля.КоличествоПрофилей > 0);
		
		ОбъектПрофиль.Клиенты.Очистить();
		
		ВыборкаКлиентов = ВыборкаПрофиля.Выбрать();
		
		Если ВыборкаКлиентов.Количество() <= 1 Тогда
			Возврат;
		КонецЕсли; 
		
		Если ОбъектПрофиль.ЭтоНовый() Тогда
			ОбъектПрофиль.УстановитьНовыйКод();
		КонецЕсли; 
		
		Пока ВыборкаКлиентов.Следующий() Цикл
			
			НоваяСтрока = ОбъектПрофиль.Клиенты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаКлиентов);
			
			Если ОчиститьПрошлыеПрофили И ЗначениеЗаполнено(ВыборкаКлиентов.Профиль) 
				И ВыборкаКлиентов.Профиль <> ОбъектПрофиль.Ссылка Тогда
				
				мОбъектПрофиль = ВыборкаКлиентов.Профиль.ПолучитьОбъект();
				СтрокаУдаления = мОбъектПрофиль.Клиенты.Найти(ВыборкаКлиентов.Клиент,"Клиент");
				
				Если СтрокаУдаления <> Неопределено Тогда
					
					мОбъектПрофиль.Клиенты.Удалить(СтрокаУдаления);
					мОбъектПрофиль.КоличествоКлиентов = мОбъектПрофиль.Клиенты.Количество();
					
					Если Не мОбъектПрофиль.ПометкаУдаления Тогда
						мОбъектПрофиль.ПометкаУдаления = (мОбъектПрофиль.Клиенты.Количество() = 0);
					КонецЕсли; 
					
					мОбъектПрофиль.ОбменДанными.Загрузка = Истина;
					мОбъектПрофиль.Записать();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбъектПрофиль.КоличествоКлиентов = ОбъектПрофиль.Клиенты.Количество();
		
		ОбъектПрофиль.ОбменДанными.Загрузка = Истина;
		
		ОбъектПрофиль.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРодственников(ФизическоеЛицо) Экспорт 
	
	Запрос = Новый Запрос;
	
	СтруктураФИО = DMS_ФизическиеЛицаСервер.ФамилияИмяОтчество(ФизическоеЛицо.Наименование);
	
	Запрос.УстановитьПараметр("ДатаРождения", 	ФизическоеЛицо.ДатаРождения);
	Запрос.УстановитьПараметр("Имя", 			СтруктураФИО.Имя);
	Запрос.УстановитьПараметр("Отчество", 		СтруктураФИО.Отчество);
	Запрос.УстановитьПараметр("Фамилия", 		СтруктураФИО.Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&ФизическоеЛицо КАК ФизическоеЛицо,
		|	&Фамилия КАК Фамилия,
		|	&Имя КАК Имя,
		|	&Отчество КАК Отчество,
		|	СоответствиеИменИОтчества.Отчество КАК ОтчествоДетей,
		|	&ДатаРождения КАК ДатаРождения,
		|	"""" КАК ИмяРодителя
		|ПОМЕСТИТЬ ФизЛицо
		|ИЗ
		|	РегистрСведений.DMS_СоответствиеИменИОтчества КАК СоответствиеИменИОтчества
		|ГДЕ
		|	СоответствиеИменИОтчества.Имя = &Имя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ФизическоеЛицо,
		|	&Фамилия,
		|	&Имя,
		|	&Отчество,
		|	"""",
		|	&ДатаРождения,
		|	СоответствиеИменИОтчества.Имя
		|ИЗ
		|	РегистрСведений.DMS_СоответствиеИменИОтчества КАК СоответствиеИменИОтчества
		|ГДЕ
		|	СоответствиеИменИОтчества.Отчество = &Отчество
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ФизическоеЛицо,
		|	&Фамилия,
		|	&Имя,
		|	&Отчество,
		|	"""",
		|	&ДатаРождения,
		|	""""
		|ИЗ
		|	РегистрСведений.DMS_СоответствиеИменИОтчества КАК СоответствиеИменИОтчества
		|ГДЕ
		|	СоответствиеИменИОтчества.Отчество = &Отчество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизЛицо.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеФизическихЛиц.ФизическоеЛицо КАК Родственник,
		|	ВЫБОР
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.мужской)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.Сын)
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.Женский)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.Дочь)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.ПустаяСсылка)
		|	КОНЕЦ КАК ТипСвязи
		|ПОМЕСТИТЬ СтепеньРодстваФизическихЛиц
		|ИЗ
		|	ФизЛицо КАК ФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО ФизЛицо.ФизическоеЛицо <> ДанныеФизическихЛиц.ФизическоеЛицо
		|			И ФизЛицо.Фамилия = ДанныеФизическихЛиц.Фамилия
		|			И ФизЛицо.ОтчествоДетей = ДанныеФизическихЛиц.Отчество
		|			И (ДанныеФизическихЛиц.ДатаРождения > ФизЛицо.ДатаРождения
		|					И ФизЛицо.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДанныеФизическихЛиц.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизЛицо.ФизическоеЛицо,
		|	ДанныеФизическихЛиц.ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.мужской)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.Отец)
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.Женский)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.Мать)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	ФизЛицо КАК ФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО (ДанныеФизическихЛиц.ДатаРождения < ФизЛицо.ДатаРождения
		|					И ФизЛицо.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДанныеФизическихЛиц.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1))
		|			И ФизЛицо.ФизическоеЛицо <> ДанныеФизическихЛиц.ФизическоеЛицо
		|			И ФизЛицо.Фамилия = ДанныеФизическихЛиц.Фамилия
		|			И ФизЛицо.ИмяРодителя = ДанныеФизическихЛиц.Имя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизЛицо.ФизическоеЛицо,
		|	ДанныеФизическихЛиц.ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.мужской)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.Брат)
		|		КОГДА ДанныеФизическихЛиц.Пол = ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.Женский)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.Сестра)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	ФизЛицо КАК ФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО ФизЛицо.ФизическоеЛицо <> ДанныеФизическихЛиц.ФизическоеЛицо
		|			И ФизЛицо.Фамилия = ДанныеФизическихЛиц.Фамилия
		|			И ФизЛицо.Отчество = ДанныеФизическихЛиц.Отчество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПереченьКлиентов.Ссылка КАК Профиль,
		|	ПереченьРодственников.Ссылка КАК ПрофильРодственника,
		|	СтепеньРодстваФизическихЛиц.ТипСвязи КАК СтепеньРодства,
		|	ИСТИНА КАК Тест
		|ИЗ
		|	СтепеньРодстваФизическихЛиц КАК СтепеньРодстваФизическихЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПрофилиКлиентов.Клиенты КАК ПереченьКлиентов
		|		ПО СтепеньРодстваФизическихЛиц.ФизическоеЛицо = ПереченьКлиентов.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПрофилиКлиентов.Клиенты КАК ПереченьРодственников
		|		ПО СтепеньРодстваФизическихЛиц.Родственник = ПереченьРодственников.Клиент
		|ГДЕ
		|	СтепеньРодстваФизическихЛиц.ТипСвязи <> ЗНАЧЕНИЕ(Справочник.DMS_СтепениРодстваФизическихЛиц.ПустаяСсылка)
		|	И НЕ ПереченьКлиентов.Ссылка ЕСТЬ NULL 
		|	И НЕ ПереченьРодственников.Ссылка ЕСТЬ NULL 
		|	И ПереченьКлиентов.Ссылка <> ПереченьРодственников.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Профиль
		|ИТОГИ ПО
		|	Профиль
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПрофиля = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаПрофиля.Следующий() Тогда 
		
		Если ЗначениеЗаполнено(ВыборкаПрофиля.Профиль) Тогда
			ОбъектПрофиль = ВыборкаПрофиля.Профиль.ПолучитьОбъект();
		Иначе 
			Возврат;
		КонецЕсли; 
		
		ВыборкаРодственников = ВыборкаПрофиля.Выбрать();
		
		Если ВыборкаРодственников.Количество() = 0 Тогда
			Возврат;
		КонецЕсли; 
		
		Пока ВыборкаРодственников.Следующий() Цикл
			
			Если ОбъектПрофиль.РодственныеСвязи.Найти(ВыборкаРодственников.ПрофильРодственника,"ПрофильРодственника") <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = ОбъектПрофиль.РодственныеСвязи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаРодственников);
			
		КонецЦикла;
		
		ОбъектПрофиль.КоличествоРодственников = ОбъектПрофиль.РодственныеСвязи.Количество();
		
		ОбъектПрофиль.ОбменДанными.Загрузка = Истина;
		
		ОбъектПрофиль.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьИзСоставаПрофиляФизическогоЛица(ФизическоеЛицо,СтруктураФИО)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Имя", 			СтруктураФИО.Имя);
	Запрос.УстановитьПараметр("Отчество", 		СтруктураФИО.Отчество);
	Запрос.УстановитьПараметр("Фамилия", 		СтруктураФИО.Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Клиенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Клиент = &ФизическоеЛицо
		|	И (Клиенты.Ссылка.Фамилия <> &Фамилия
		|	ИЛИ Клиенты.Ссылка.Имя <> &Имя
		|	ИЛИ Клиенты.Ссылка.Отчество <> &Отчество)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПрофилей = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПрофилей.Следующий() Цикл
		
		ОбъектПрофиль = ВыборкаПрофилей.Ссылка.ПолучитьОбъект();
		СтрокаКУдалению = ОбъектПрофиль.Клиенты.Найти(ФизическоеЛицо,"Клиент");
		
		Если СтрокаКУдалению <> Неопределено Тогда
			ОбъектПрофиль.Клиенты.Удалить(СтрокаКУдалению);
		КонецЕсли; 
		
		Если Не ОбъектПрофиль.ПометкаУдаления Тогда
			
			ОбъектПрофиль.ПометкаУдаления = (ОбъектПрофиль.Клиенты.Количество() = 0);
			
		КонецЕсли; 
		
		ОбъектПрофиль.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
